zlittell/MSF-XINPUT/MSF_XINPUT/Teensyduino Files that were edited/hardware/teensy/avr/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.keys=Keyboard Layout


teensy31.name=Teensy 3.1
teensy31.upload.maximum_size=262144
teensy31.upload.maximum_data_size=65536
teensy31.upload.tool=teensyloader
teensy31.upload.protocol=halfkay
teensy31.build.board=TEENSY31
teensy31.build.core=teensy3
teensy31.build.mcu=mk20dx256
teensy31.build.toolchain=hardware/tools/arm/bin/
teensy31.build.command.gcc=arm-none-eabi-gcc
teensy31.build.command.g++=arm-none-eabi-g++
teensy31.build.command.ar=arm-none-eabi-ar
teensy31.build.command.objcopy=arm-none-eabi-objcopy
teensy31.build.command.objdump=arm-none-eabi-objdump
teensy31.build.command.size=arm-none-eabi-size
teensy31.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -MMD -nostdlib
teensy31.build.flags.optimize=-Os
teensy31.build.flags.cpu=-mthumb -mcpu=cortex-m4
teensy31.build.flags.defs=-D__MK20DX256__ -DTEENSYDUINO=121
#uncomment this line and remove the one above, for use with Visual Micro
#teensy31.build.flags.defs=-D__MK20DX256__ -DTEENSYDUINO=121 -DF_CPU=96000000 -DUSB_SERIAL -DLAYOUT_US_ENGLISH
teensy31.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
teensy31.build.flags.c=
teensy31.build.flags.S=-x assembler-with-cpp
teensy31.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk20dx256.ld"
teensy31.build.flags.libs=-larm_cortexM4l_math -lm
teensy31.serial.restart_cmd=false

teensy31.menu.usb.serial=Serial
teensy31.menu.usb.serial.build.usbtype=USB_SERIAL
teensy31.menu.usb.hid=Keyboard + Mouse + Joystick
teensy31.menu.usb.hid.build.usbtype=USB_HID
teensy31.menu.usb.hid.fake_serial=teensy_gateway
teensy31.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy31.menu.usb.serialhid.build.usbtype=USB_SERIAL_HID
teensy31.menu.usb.midi=MIDI
teensy31.menu.usb.midi.build.usbtype=USB_MIDI
teensy31.menu.usb.midi.fake_serial=teensy_gateway
teensy31.menu.usb.rawhid=Raw HID
teensy31.menu.usb.rawhid.build.usbtype=USB_RAWHID
teensy31.menu.usb.rawhid.fake_serial=teensy_gateway
teensy31.menu.usb.flightsim=Flight Sim Controls
teensy31.menu.usb.flightsim.build.usbtype=USB_FLIGHTSIM
teensy31.menu.usb.flightsim.fake_serial=teensy_gateway
teensy31.menu.usb.xinput=[MSF] XINPUT Controller
teensy31.menu.usb.xinput.build.usbtype=USB_XINPUT
teensy31.menu.usb.xinput.fake_serial=teensy_gateway
teensy31.menu.usb.disable=No USB
teensy31.menu.usb.disable.build.usbtype=USB_DISABLED
#uncomment these if you want to try faster overclocking
#teensy31.menu.speed.168opt=168 MHz optimized (overclock)
#teensy31.menu.speed.144opt=144 MHz optimized (overclock)
#teensy31.menu.speed.120opt=120 MHz optimized (overclock)
teensy31.menu.speed.96opt=96 MHz optimized (overclock)
teensy31.menu.speed.72opt=72 MHz optimized
teensy31.menu.speed.48opt=48 MHz optimized
teensy31.menu.speed.24opt=24 MHz optimized
teensy31.menu.speed.96=96 MHz (overclock)
teensy31.menu.speed.72=72 MHz
teensy31.menu.speed.48=48 MHz
teensy31.menu.speed.24=24 MHz
teensy31.menu.speed.16=16 MHz (No USB)
teensy31.menu.speed.8=8 MHz (No USB)
teensy31.menu.speed.4=4 MHz (No USB)
teensy31.menu.speed.2=2 MHz (No USB)
teensy31.menu.speed.168opt.build.fcpu=168000000
teensy31.menu.speed.168opt.build.flags.optimize=-O
teensy31.menu.speed.168opt.build.flags.ldspecs=
teensy31.menu.speed.144opt.build.fcpu=144000000
teensy31.menu.speed.144opt.build.flags.optimize=-O
teensy31.menu.speed.144opt.build.flags.ldspecs=
teensy31.menu.speed.120opt.build.fcpu=120000000
teensy31.menu.speed.120opt.build.flags.optimize=-O
teensy31.menu.speed.120opt.build.flags.ldspecs=
teensy31.menu.speed.96opt.build.fcpu=96000000
teensy31.menu.speed.96opt.build.flags.optimize=-O
teensy31.menu.speed.96opt.build.flags.ldspecs=
teensy31.menu.speed.72opt.build.fcpu=72000000
teensy31.menu.speed.72opt.build.flags.optimize=-O
teensy31.menu.speed.72opt.build.flags.ldspecs=
teensy31.menu.speed.48opt.build.fcpu=48000000
teensy31.menu.speed.48opt.build.flags.optimize=-O
teensy31.menu.speed.48opt.build.flags.ldspecs=
teensy31.menu.speed.24opt.build.fcpu=48000000
teensy31.menu.speed.24opt.build.flags.optimize=-O
teensy31.menu.speed.24opt.build.flags.ldspecs=
teensy31.menu.speed.96.build.fcpu=96000000
teensy31.menu.speed.96.build.flags.optimize=-Os
teensy31.menu.speed.96.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.72.build.fcpu=72000000
teensy31.menu.speed.72.build.flags.optimize=-Os
teensy31.menu.speed.72.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.48.build.fcpu=48000000
teensy31.menu.speed.48.build.flags.optimize=-Os
teensy31.menu.speed.48.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.24.build.fcpu=24000000
teensy31.menu.speed.24.build.flags.optimize=-Os
teensy31.menu.speed.24.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.16.build.fcpu=16000000
teensy31.menu.speed.16.build.flags.optimize=-Os
teensy31.menu.speed.16.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.8.build.fcpu=8000000
teensy31.menu.speed.8.build.flags.optimize=-Os
teensy31.menu.speed.8.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.4.build.fcpu=4000000
teensy31.menu.speed.4.build.flags.optimize=-Os
teensy31.menu.speed.4.build.flags.ldspecs=--specs=nano.specs
teensy31.menu.speed.2.build.fcpu=2000000
teensy31.menu.speed.2.build.flags.optimize=-Os
teensy31.menu.speed.2.build.flags.ldspecs=--specs=nano.specs

teensy31.menu.keys.en-us=US English
teensy31.menu.keys.en-us.build.keylayout=US_ENGLISH
teensy31.menu.keys.fr-ca=Canadian French
teensy31.menu.keys.fr-ca.build.keylayout=CANADIAN_FRENCH
teensy31.menu.keys.xx-ca=Canadian Multilingual
teensy31.menu.keys.xx-ca.build.keylayout=CANADIAN_MULTILINGUAL
teensy31.menu.keys.cz-cz=Czech
teensy31.menu.keys.cz-cz.build.keylayout=CZECH
teensy31.menu.keys.da-da=Danish
teensy31.menu.keys.da-da.build.keylayout=DANISH
teensy31.menu.keys.fi-fi=Finnish
teensy31.menu.keys.fi-fi.build.keylayout=FINNISH
teensy31.menu.keys.fr-fr=French
teensy31.menu.keys.fr-fr.build.keylayout=FRENCH
teensy31.menu.keys.fr-be=French Belgian
teensy31.menu.keys.fr-be.build.keylayout=FRENCH_BELGIAN
teensy31.menu.keys.fr-ch=French Swiss
teensy31.menu.keys.fr-ch.build.keylayout=FRENCH_SWISS
teensy31.menu.keys.de-de=German
teensy31.menu.keys.de-de.build.keylayout=GERMAN
teensy31.menu.keys.de-dm=German (Mac)
teensy31.menu.keys.de-dm.build.keylayout=GERMAN_MAC
teensy31.menu.keys.de-ch=German Swiss
teensy31.menu.keys.de-ch.build.keylayout=GERMAN_SWISS
teensy31.menu.keys.is-is=Icelandic
teensy31.menu.keys.is-is.build.keylayout=ICELANDIC
teensy31.menu.keys.en-ie=Irish
teensy31.menu.keys.en-ie.build.keylayout=IRISH
teensy31.menu.keys.it-it=Italian
teensy31.menu.keys.it-it.build.keylayout=ITALIAN
teensy31.menu.keys.no-no=Norwegian
teensy31.menu.keys.no-no.build.keylayout=NORWEGIAN
teensy31.menu.keys.pt-pt=Portuguese
teensy31.menu.keys.pt-pt.build.keylayout=PORTUGUESE
teensy31.menu.keys.pt-br=Portuguese Brazilian
teensy31.menu.keys.pt-br.build.keylayout=PORTUGUESE_BRAZILIAN
teensy31.menu.keys.rs-rs=Serbian (Latin Only)
teensy31.menu.keys.rs-rs.build.keylayout=SERBIAN_LATIN_ONLY
teensy31.menu.keys.es-es=Spanish
teensy31.menu.keys.es-es.build.keylayout=SPANISH
teensy31.menu.keys.es-mx=Spanish Latin America
teensy31.menu.keys.es-mx.build.keylayout=SPANISH_LATIN_AMERICA
teensy31.menu.keys.sv-se=Swedish
teensy31.menu.keys.sv-se.build.keylayout=SWEDISH
teensy31.menu.keys.tr-tr=Turkish (partial)
teensy31.menu.keys.tr-tr.build.keylayout=TURKISH
teensy31.menu.keys.en-gb=United Kingdom
teensy31.menu.keys.en-gb.build.keylayout=UNITED_KINGDOM
teensy31.menu.keys.usint=US International
teensy31.menu.keys.usint.build.keylayout=US_INTERNATIONAL







teensy30.name=Teensy 3.0
teensy30.upload.maximum_size=131072
teensy30.upload.maximum_data_size=16384
teensy30.upload.tool=teensyloader
teensy30.upload.protocol=halfkay
teensy30.build.board=TEENSY30
teensy30.build.core=teensy3
teensy30.build.mcu=mk20dx128
teensy30.build.toolchain=hardware/tools/arm/bin/
teensy30.build.command.gcc=arm-none-eabi-gcc
teensy30.build.command.g++=arm-none-eabi-g++
teensy30.build.command.ar=arm-none-eabi-ar
teensy30.build.command.objcopy=arm-none-eabi-objcopy
teensy30.build.command.objdump=arm-none-eabi-objdump
teensy30.build.command.size=arm-none-eabi-size
teensy30.build.flags.common=-g -Wall -ffunction-sections -fdata-sections -MMD -nostdlib
teensy30.build.flags.optimize=-Os
teensy30.build.flags.cpu=-mthumb -mcpu=cortex-m4
teensy30.build.flags.defs=-D__MK20DX128__ -DTEENSYDUINO=121
teensy30.build.flags.cpp=-fno-exceptions -felide-constructors -std=gnu++0x -fno-rtti
teensy30.build.flags.c=
teensy30.build.flags.S=-x assembler-with-cpp
teensy30.build.flags.ld=-Wl,--gc-sections,--relax,--defsym=__rtc_localtime={extra.time.local} "-T{build.core.path}/mk20dx128.ld"
teensy30.build.flags.ldspecs=--specs=nano.specs
teensy30.build.flags.libs=-larm_cortexM4l_math -lm
teensy30.serial.restart_cmd=false

